import ShowCasePoet from './ShowCasePoet.vue'

describe('<ShowCasePoet />', () => {
  it('renders poet(name,time-period and bio) properly', () => {
    cy.mount(ShowCasePoet, {
      props: {
        details: {
          "id": 1,
          "name": "عنترة بن شداد",
          "bio": "عنترة بن عمرو بن شداد بن معاوية بن قراد العبسي (525 م - 608 م) هو أحد أشهر شعراء العرب في فترة ما قبل الإسلام، اشتهر بشعر الفروسية، وله معلقة مشهورة. وهو أشهر فرسان العرب وأشعرهم وشاعر المعلقات والمعروف بشعره الجميل وغزله العفيف بعبلة.",
          "time_period": "العصر الجاهلي"        }
      }
    })
    cy.get('.poet h2').should('contain', "عنترة بن شداد - العصر الجاهلي")
    cy.get('.poet .bio').should('contain', "عنترة بن عمرو بن شداد بن معاوية بن قراد العبسي (525 م - 608 م) هو أحد أشهر شعراء العرب في فترة ما قبل الإسلام، اشتهر بشعر الفروسية، وله معلقة مشهورة. وهو أشهر فرسان العرب وأشعرهم وشاعر المعلقات والمعروف بشعره الجميل وغزله العفيف بعبلة.")
  })
})